JamesBara/DAP_Link_Tiny/Inc/stm32l412_def.h
#ifndef STM32L412_DEF_H
#define STM32L412_DEF_H

#include "stm32l412_system.h"
#include "macros.h"

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
- GPIO for STM32L412
******************************************************************************/
typedef struct
{
	volatile uint32_t moder;
	volatile uint32_t otyper;
	volatile uint32_t ospeedr;
	volatile uint32_t pupdr;
	volatile uint32_t idr;
	volatile uint32_t odr;
	volatile uint32_t bsrr;
	volatile uint32_t lckr;
	volatile uint32_t afr[2];
	volatile uint32_t brr;
} gpio_reg_type;

#define GPIO_BASE_ADDR (0x48000000UL)

#define GPIOA ((gpio_reg_type*) GPIO_BASE_ADDR)
#define GPIOB ((gpio_reg_type*) (GPIO_BASE_ADDR + 0x400U))

/*USB PIN definitions*/
#define GPIO_USB_FS_PORT GPIOA
#define GPIO_USB_DM_PIN (0xBU)
#define GPIO_USB_DP_PIN (0xCU)

/*DAP SW definitions*/
#define GPIO_DAP_nRESET_PORT GPIOB
#define GPIO_DAP_SWCLK_PORT GPIOB
#define GPIO_DAP_SWDIO_PORT GPIOB
#define GPIO_DAP_nRESET_PIN (0x7U)
#define GPIO_DAP_SWCLK_PIN (0x8U)
#define GPIO_DAP_SWDIO_PIN (0x9U)

/*gpio helper definitions*/
#define GPIO_MODDER_POS(x) ((x) << 0x1U)
#define GPIO_OSPEEDR_POS(x) ((x) << 0x1U)
#define GPIO_PUPDR_POS(x) ((x) << 0x1U)

#define GPIO_MASK (0x3U)
#define GPIO_INPUT (0x0U)
#define GPIO_OUTPUT (0x1U)
#define GPIO_ALTERNATE_FUNCTION (0x2U)
#define GPIO_ANALOG (0x3U)

#define GPIO_VERY_HIGH_SPEED (0x3U)

#define GPIO_AFRN(x) ((x) >> 0x3U)
#define GPIO_AFSELN_POS(x) (((x) & 0x07U) << 0x2U)
#define GPIO_AFSELN_MASK (0xFU)

/*USB definitions*/
/*usb_dm gpio*/
#define GPIO_CLEAR_USB_DM_MODER() _MACRO_CLEAR_BIT_VAL(GPIO_USB_FS_PORT->moder, GPIO_MASK, GPIO_MODDER_POS(GPIO_USB_DM_PIN))
#define GPIO_CLEAR_USB_DM_OSPEEDR() _MACRO_CLEAR_BIT_VAL(GPIO_USB_FS_PORT->ospeedr, GPIO_MASK, GPIO_OSPEEDR_POS(GPIO_USB_DM_PIN))
#define GPIO_CLEAR_USB_DM_OTYPER() _MACRO_CLEAR_BIT(GPIO_USB_FS_PORT->otyper, GPIO_USB_DM_PIN)
#define GPIO_CLEAR_USB_DM_PUPDR() _MACRO_CLEAR_BIT_VAL(GPIO_USB_FS_PORT->pupdr, GPIO_MASK, GPIO_PUPDR_POS(GPIO_USB_DM_PIN))
#define GPIO_CLEAR_USB_DM_AFR() _MACRO_CLEAR_BIT_VAL(GPIO_USB_FS_PORT->afr[GPIO_AFRN(GPIO_USB_DM_PIN)], GPIO_AFSELN_MASK, GPIO_AFSELN_POS(GPIO_USB_DM_PIN))

#define GPIO_SET_USB_DM_MODER() _MACRO_SET_BIT_VAL(GPIO_USB_FS_PORT->moder, GPIO_ALTERNATE_FUNCTION, GPIO_MODDER_POS(GPIO_USB_DM_PIN))
#define GPIO_SET_USB_DM_OSPEEDR() _MACRO_SET_BIT_VAL(GPIO_USB_FS_PORT->ospeedr, GPIO_VERY_HIGH_SPEED, GPIO_OSPEEDR_POS(GPIO_USB_DM_PIN))
#define GPIO_SET_USB_DM_AFR() _MACRO_SET_BIT_VAL(GPIO_USB_FS_PORT->afr[GPIO_AFRN(GPIO_USB_DM_PIN)], 10U, GPIO_AFSELN_POS(GPIO_USB_DM_PIN))

/*usb_dp gpio*/
#define GPIO_CLEAR_USB_DP_MODER() _MACRO_CLEAR_BIT_VAL(GPIO_USB_FS_PORT->moder, GPIO_MASK, GPIO_MODDER_POS(GPIO_USB_DP_PIN))
#define GPIO_CLEAR_USB_DP_OSPEEDR() _MACRO_CLEAR_BIT_VAL(GPIO_USB_FS_PORT->ospeedr, GPIO_MASK, GPIO_OSPEEDR_POS(GPIO_USB_DP_PIN))
#define GPIO_CLEAR_USB_DP_OTYPER() _MACRO_CLEAR_BIT(GPIO_USB_FS_PORT->otyper, GPIO_USB_DP_PIN)
#define GPIO_CLEAR_USB_DP_PUPDR() _MACRO_CLEAR_BIT_VAL(GPIO_USB_FS_PORT->pupdr, GPIO_MASK, GPIO_PUPDR_POS(GPIO_USB_DP_PIN))
#define GPIO_CLEAR_USB_DP_AFR() _MACRO_CLEAR_BIT_VAL(GPIO_USB_FS_PORT->afr[GPIO_AFRN(GPIO_USB_DP_PIN)], GPIO_AFSELN_MASK, GPIO_AFSELN_POS(GPIO_USB_DP_PIN))

#define GPIO_SET_USB_DP_MODER() _MACRO_SET_BIT_VAL(GPIO_USB_FS_PORT->moder, GPIO_ALTERNATE_FUNCTION, GPIO_MODDER_POS(GPIO_USB_DP_PIN))
#define GPIO_SET_USB_DP_OSPEEDR() _MACRO_SET_BIT_VAL(GPIO_USB_FS_PORT->ospeedr, GPIO_VERY_HIGH_SPEED, GPIO_OSPEEDR_POS(GPIO_USB_DP_PIN))
#define GPIO_SET_USB_DP_AFR() _MACRO_SET_BIT_VAL(GPIO_USB_FS_PORT->afr[GPIO_AFRN(GPIO_USB_DP_PIN)], 10U, GPIO_AFSELN_POS(GPIO_USB_DP_PIN))






#define GPIO_USB_DM_DP_ENABLE() do \
{ \
	GPIO_CLEAR_USB_DM_MODER(); \
	GPIO_CLEAR_USB_DM_OSPEEDR(); \
	GPIO_CLEAR_USB_DM_OTYPER(); \
	GPIO_CLEAR_USB_DM_PUPDR(); \
	GPIO_CLEAR_USB_DM_AFR(); \
	GPIO_CLEAR_USB_DP_MODER(); \
	GPIO_CLEAR_USB_DP_OSPEEDR(); \
	GPIO_CLEAR_USB_DP_OTYPER(); \
	GPIO_CLEAR_USB_DP_PUPDR(); \
	GPIO_CLEAR_USB_DP_AFR(); \
	GPIO_SET_USB_DM_MODER(); \
	GPIO_SET_USB_DM_OSPEEDR(); \
	GPIO_SET_USB_DM_AFR(); \
	GPIO_SET_USB_DP_MODER(); \
	GPIO_SET_USB_DP_OSPEEDR(); \
	GPIO_SET_USB_DP_AFR(); \
}while(0)



/*DAP definitions*/
/*nreset gpio*/
#define GPIO_CLEAR_DAP_nRESET_MODER() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_nRESET_PORT->moder, GPIO_MASK, GPIO_MODDER_POS(GPIO_DAP_nRESET_PIN))
#define GPIO_CLEAR_DAP_nRESET_OSPEEDR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_nRESET_PORT->ospeedr, GPIO_MASK, GPIO_OSPEEDR_POS(GPIO_DAP_nRESET_PIN))
#define GPIO_CLEAR_DAP_nRESET_OTYPER() _MACRO_CLEAR_BIT(GPIO_DAP_nRESET_PORT->otyper, GPIO_DAP_nRESET_PIN)
#define GPIO_CLEAR_DAP_nRESET_PUPDR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_nRESET_PORT->pupdr, GPIO_MASK, GPIO_PUPDR_POS(GPIO_DAP_nRESET_PIN))
#define GPIO_CLEAR_DAP_nRESET_AFR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_nRESET_PORT->afr[GPIO_AFRN(GPIO_DAP_nRESET_PIN)], GPIO_AFSELN_MASK, GPIO_AFSELN_POS(GPIO_DAP_nRESET_PIN))

#define GPIO_SET_DAP_nRESET_MODER() _MACRO_SET_BIT_VAL(GPIO_DAP_nRESET_PORT->moder, GPIO_OUTPUT, GPIO_MODDER_POS(GPIO_DAP_nRESET_PIN))
#define GPIO_SET_DAP_nRESET_OSPEEDR() _MACRO_SET_BIT_VAL(GPIO_DAP_nRESET_PORT->ospeedr, GPIO_VERY_HIGH_SPEED, GPIO_OSPEEDR_POS(GPIO_DAP_nRESET_PIN))
#define GPIO_SET_DAP_nRESET_OTYPER() _MACRO_SET_BIT(GPIO_DAP_nRESET_PORT->otyper, GPIO_DAP_nRESET_PIN)

#define GPIO_GET_DAP_nRESET() (_MACRO_GET_BIT(GPIO_DAP_nRESET_PORT->odr, GPIO_DAP_nRESET_PIN))
#define GPIO_SET_DAP_nRESET() (GPIO_DAP_nRESET_PORT->bsrr = (0x1U << GPIO_DAP_nRESET_PIN))
#define GPIO_CLEAR_DAP_nRESET() (GPIO_DAP_nRESET_PORT->brr = (0x1U << GPIO_DAP_nRESET_PIN))

/*swclk gpio*/
#define GPIO_CLEAR_DAP_SWCLK_MODER() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_SWCLK_PORT->moder, GPIO_MASK, GPIO_MODDER_POS(GPIO_DAP_SWCLK_PIN))
#define GPIO_CLEAR_DAP_SWCLK_OSPEEDR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_SWCLK_PORT->ospeedr, GPIO_MASK, GPIO_OSPEEDR_POS(GPIO_DAP_SWCLK_PIN))
#define GPIO_CLEAR_DAP_SWCLK_OTYPER() _MACRO_CLEAR_BIT(GPIO_DAP_SWCLK_PORT->otyper, GPIO_DAP_SWCLK_PIN)
#define GPIO_CLEAR_DAP_SWCLK_PUPDR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_SWCLK_PORT->pupdr, GPIO_MASK, GPIO_PUPDR_POS(GPIO_DAP_SWCLK_PIN))
#define GPIO_CLEAR_DAP_SWCLK_AFR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_SWCLK_PORT->afr[GPIO_AFRN(GPIO_DAP_SWCLK_PIN)], GPIO_AFSELN_MASK, GPIO_AFSELN_POS(GPIO_DAP_SWCLK_PIN))

#define GPIO_SET_DAP_SWCLK_MODER() _MACRO_SET_BIT_VAL(GPIO_DAP_SWCLK_PORT->moder, GPIO_OUTPUT, GPIO_MODDER_POS(GPIO_DAP_SWCLK_PIN))
#define GPIO_SET_DAP_SWCLK_OSPEEDR() _MACRO_SET_BIT_VAL(GPIO_DAP_SWCLK_PORT->ospeedr, GPIO_VERY_HIGH_SPEED, GPIO_OSPEEDR_POS(GPIO_DAP_SWCLK_PIN))

#define GPIO_GET_DAP_SWCLK() (_MACRO_GET_BIT(GPIO_DAP_SWCLK_PORT->odr, GPIO_DAP_SWCLK_PIN))
#define GPIO_SET_DAP_SWCLK() (GPIO_DAP_SWCLK_PORT->bsrr = (0x1U << GPIO_DAP_SWCLK_PIN))
#define GPIO_CLEAR_DAP_SWCLK() (GPIO_DAP_SWCLK_PORT->brr = (0x1U << GPIO_DAP_SWCLK_PIN))

