JamesBara/DAP_Link_Tiny/Inc/stm32l412_def.h
/*swdio gpio*/
#define GPIO_CLEAR_DAP_SWDIO_MODER() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_SWDIO_PORT->moder, GPIO_MASK, GPIO_MODDER_POS(GPIO_DAP_SWDIO_PIN))
#define GPIO_CLEAR_DAP_SWDIO_OSPEEDR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_SWDIO_PORT->ospeedr, GPIO_MASK, GPIO_OSPEEDR_POS(GPIO_DAP_SWDIO_PIN))
#define GPIO_CLEAR_DAP_SWDIO_OTYPER() _MACRO_CLEAR_BIT(GPIO_DAP_SWDIO_PORT->otyper, GPIO_DAP_SWDIO_PIN)
#define GPIO_CLEAR_DAP_SWDIO_PUPDR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_SWDIO_PORT->pupdr, GPIO_MASK, GPIO_PUPDR_POS(GPIO_DAP_SWDIO_PIN))
#define GPIO_CLEAR_DAP_SWDIO_AFR() _MACRO_CLEAR_BIT_VAL(GPIO_DAP_SWDIO_PORT->afr[GPIO_AFRN(GPIO_DAP_SWDIO_PIN)], GPIO_AFSELN_MASK, GPIO_AFSELN_POS(GPIO_DAP_SWDIO_PIN))

#define GPIO_SET_DAP_SWDIO_MODER() _MACRO_SET_BIT_VAL(GPIO_DAP_SWDIO_PORT->moder, GPIO_OUTPUT, GPIO_MODDER_POS(GPIO_DAP_SWDIO_PIN))
#define GPIO_SET_DAP_SWDIO_OSPEEDR() _MACRO_SET_BIT_VAL(GPIO_DAP_SWDIO_PORT->ospeedr, GPIO_VERY_HIGH_SPEED, GPIO_OSPEEDR_POS(GPIO_DAP_SWDIO_PIN))

#define GPIO_GET_DAP_SWDIO() (_MACRO_GET_BIT(GPIO_DAP_SWDIO_PORT->idr, GPIO_DAP_SWDIO_PIN))
#define GPIO_SET_DAP_SWDIO() (GPIO_DAP_SWDIO_PORT->bsrr = (0x1U << GPIO_DAP_SWDIO_PIN))
#define GPIO_CLEAR_DAP_SWDIO() (GPIO_DAP_SWDIO_PORT->brr = (0x1U << GPIO_DAP_SWDIO_PIN))

/*******************************************************************************
- PWR for STM32L412
******************************************************************************/
typedef struct
{
	volatile uint32_t cr1;
	volatile uint32_t cr2;
	volatile uint32_t cr3;
	volatile uint32_t cr4;
	volatile uint16_t sr1;
	volatile uint32_t sr2;
	volatile uint32_t scr;
	uint32_t reserved0;
	volatile uint32_t pucra;
	volatile uint32_t pdcra;
	volatile uint32_t pucrb;
	volatile uint32_t pdcrb;
	volatile uint32_t pucrc;
	volatile uint32_t pdcrc;
	volatile uint32_t pucrd;
	volatile uint32_t pdcrd;
	volatile uint32_t pucre;
	volatile uint32_t pdcre;
	uint32_t reserved1;
	uint32_t reserved2;
	uint32_t reserved3;
	uint32_t reserved4;
	volatile uint32_t pucrh;
	volatile uint32_t pdcrh;
} pwr_reg_type;

#define PWR_BASE_ADDR (0x40007000UL)

#define PWR ((pwr_reg_type *) PWR_BASE_ADDR)

#define PWR_LPMS_POS (0x0U)
#define PWR_LPMS_STOP_0 (0x0U)
#define PWR_LPMS_STOP_1 (0x1U)
#define PWR_LPMS_STOP_2 (0x2U)
#define PWR_LPMS_STANDBY (0x3U)
#define PWR_LPMS_SHUTDOWN (0x4U)
#define PWR_LPMS_MASK (0x7U)

#define PWR_USV_POS (0xAU)

#define PWR_SET_USB_SUPPLY_VALID() (_MACRO_SET_BIT(PWR->cr2, PWR_USV_POS))

#define PWR_CLEAR_LOW_POWER_MODE() (_MACRO_CLEAR_BIT_VAL(PWR->cr1, PWR_LPMS_MASK, PWR_LPMS_POS))
#define PWR_SET_LOW_POWER_MODE_STOP_0() PWR_CLEAR_LOW_POWER_MODE
#define PWR_SET_LOW_POWER_MODE_STOP_1() (_MACRO_SET_BIT_VAL(PWR->cr1, PWR_LPMS_STOP_1, PWR_LPMS_POS))

/*******************************************************************************
- RCC for STM32L412
******************************************************************************/
typedef struct
{
	volatile uint32_t cr;
	volatile uint32_t icscr;
	volatile uint32_t cfgr;
	volatile uint32_t pllcfgr;
	uint32_t reserved0;
	uint32_t reserved1;
	volatile uint32_t cier;
	volatile uint32_t cifr;
	volatile uint32_t cicr;
	uint32_t reserved2;
	volatile uint32_t ahb1rstr;
	volatile uint32_t ahb2rstr;
	volatile uint32_t ahb3rstr;
	uint32_t reserved3;
	volatile uint32_t apb1rstr1;
	volatile uint32_t apb1rstr2;
	volatile uint32_t apb2rstr;
	uint32_t reserved4;
	volatile uint32_t ahb1enr;
	volatile uint32_t ahb2enr;
	volatile uint32_t ahb3enr;
	uint32_t reserved5;
	volatile uint32_t apb1enr1;
	volatile uint32_t apb1enr2;
	volatile uint32_t apb2enr;
	uint32_t reserved6;
	volatile uint32_t ahb1smenr;
	volatile uint32_t ahb2smenr;
	volatile uint32_t ahb3smenr;
	uint32_t reserved7;
	volatile uint32_t apb1smenr1;
	volatile uint32_t apb1smenr2;
	volatile uint32_t apb2smenr;
	uint32_t reserved8;
	volatile uint32_t ccipr;
	uint32_t reserved9;
	volatile uint32_t bdcr;
	volatile uint32_t csr;
	volatile uint32_t crrcr;
} rcc_reg_type;

#define RCC_BASE_ADDR (0x40021000UL)

#define RCC ((rcc_reg_type*) RCC_BASE_ADDR)

#define RCC_MSI_MAX_FREQ_RANGE (0xBU)
#define RCC_BYP_MAX (0x1U)
#define RCC_PLLSRC_MAX (0x3U)
#define RCC_PLLM_MAX (0x7U)
#define RCC_PLLN_MIN (0x8U)
#define RCC_PLLN_MAX (0x56U)
#define RCC_PLLQ_MAX (0x3U)
#define RCC_PLLR_MAX (0x3U)
#define RCC_PPRE_MAX (0x7U)
#define RCC_SW_MAX (0x3U)
#define RCC_CSS_MAX (0x1U)
#define RCC_HPRE_MAX (0xFU)
#define RCC_CLK48SEL_MAX (0x3U)

/*cr register*/
#define RCC_MSION_POS (0x0U)
#define RCC_MSIRDY_POS (0x1U)
#define RCC_MSIRGSEL_POS (0x3U)
#define RCC_CR_MSIRANGE_POS (0x4U)
#define RCC_HSION_POS (0x8U)
#define RCC_HSIRDY_POS (0xAU)
#define RCC_HSEON_POS (0x10U)
#define RCC_HSERDY_POS (0x11U)
#define RCC_HSEBYP_POS (0x12U)
#define RCC_CSSON_POS (0x13U)
#define RCC_PLLON_POS (0x18U)
#define RCC_PLLRDY_POS (0x19U)

#define RCC_CR_MSIRANGE_MASK (0xFU)

/*Remove?*/
#define RCC_MSION (0x1U << RCC_MSION_POS)
#define RCC_MSIRDY (0x1U << RCC_MSIRDY_POS)
#define RCC_MSIRGSEL (0x1U << RCC_MSIRGSEL_POS)
#define RCC_HSION (0x1U << RCC_HSION_POS)
#define RCC_HSIRDY (0x1U << RCC_HSIRDY_POS)
#define RCC_HSERDY (0x1U << RCC_HSERDY_POS)
#define RCC_PLLRDY (0x1U << RCC_PLLRDY_POS)

/*cgfr register*/
#define RCC_SW_POS (0x0U)
#define RCC_SWS_POS (0x2U)
#define RCC_HPRE_POS (0x4U)
#define RCC_PPRE1_POS (0x8U)
#define RCC_PPRE2_POS (0xBU)
#define RCC_STOPWUCK_POS (0xFU)
#define RCC_MCOSEL_POS (0x18U)
#define RCC_MCOPRE_POS (0x1CU)

#define RCC_SW_MASK (0x3U)
#define RCC_SW_MSI (0x0U)
#define RCC_SW_HSI16 (0x1U)
#define RCC_SW_HSE (0x2U)
#define RCC_SW_PLL (0x3U)
#define RCC_SWS_MASK (0x3U)
#define RCC_SWS_MSI (0x0U)
#define RCC_SWS_HSI16 (0x1U)
#define RCC_SWS_HSE (0x2U)
#define RCC_SWS_PLL (0x3U)

#define RCC_HPRE_MASK (0xFU)
#define RCC_PPRE_MASK (0x7U)
#define RCC_MCOSEL_MASK (0xFU)
#define RCC_MCOPRE_MASK (0x7U)

#define RCC_SW (RCC_SW_MASK << RCC_SW_POS)
#define RCC_HPRE (RCC_HPRE_MASK << RCC_HPRE_POS)

/*pllcgfr register*/
#define RCC_PLLSRC_POS (0x0U)
#define RCC_PLLM_POS (0x4U)
#define RCC_PLLN_POS (0x8U)
#define RCC_PLLQEN_POS (0x14U)
#define RCC_PLLQ_POS (0x15U)
#define RCC_PLLREN_POS (0x18U)
#define RCC_PLLR_POS (0x19U)

#define RCC_PLLSRC_MASK (0x3U)
#define RCC_PLLSRC_NO (0x0U)
#define RCC_PLLSRC_MSI (0x1U)
#define RCC_PLLSRC_HSI16 (0x2U)
#define RCC_PLLSRC_HSE (0x3U)
#define RCC_PLLM_MASK (0x7U)
#define RCC_PLLN_MASK (0x7FU)
#define RCC_PLLQ_MASK (0x3U)
#define RCC_PLLR_MASK (0x3U)

