JamesBara/DAP_Link_Tiny/Inc/stm32l412_def.h
#define RCC_PLLSRC (RCC_PLLSRC_MASK << RCC_PLLSRC_POS)
#define RCC_PLLM (RCC_PLLM_MASK << RCC_PLLM_POS)
#define RCC_PLLN (RCC_PLLN_MASK << RCC_PLLN_POS)
#define RCC_PLLQ (RCC_PLLQ_MASK << RCC_PLLQ_POS)
#define RCC_PLLR (RCC_PLLR_MASK << RCC_PLLR_POS)


/*ccipr register*/
#define RCC_CLK48SEL_POS (0x1A)


#define RCC_CLK48SEL_MASK (0x3U)
#define RCC_CLK48SEL_HSI48 (0x0U)
#define RCC_CLK48SEL_PLLQ (0x2U)
#define RCC_CLK48SEL_MSI (0x3U)


/*bdcr register*/
#define RCC_LSEBYP_POS (0x2U)
#define RCC_LSEDRV_POS (0x3U)
#define RCC_LSECSSON_POS (0x5U)
#define RCC_LSESYSDIS_POS (0x7U)
#define RCC_RTCSEL_POS (0x8U)
#define RCC_LSCOEN_POS (0x18U)
#define RCC_LSCOSEL_POS (0x19U)

/*csr register*/
#define RCC_CSR_MSIRANGE_POS (0x8U)
#define RCC_LSIPREDIV_POS (0x4U)
#define RCC_RESET_FLAGS_POS (0x18U)

#define RCC_CSR_MSIRANGE_MASK (0xFU)

/*crrcr register*/
#define RCC_HSI48ON_POS (0x0U)
#define RCC_HSI48RDY_POS (0x1U)

/*ahb1 register*/

/*ahb2 register*/
#define RCC_GPIOA_POS (0x0U)
#define RCC_GPIOB_POS (0x1U)
#define RCC_GPIOC_POS (0x2U)
#define RCC_GPIOH_POS (0x7U)

/*ahb3 register*/


/*apb1r1 register*/
#define RCC_USB_POS (0x1AU)
#define RCC_PWR_POS (0x1CU)


/*apb1r2 register*/

/*apb2 register*/


/*Misc*/
#define RCC_PLL_INPUT_MIN_FREQ (4000000U)
#define RCC_PLL_INPUT_MAX_FREQ (16000000U)
#define RCC_VCO_MIN_FREQ (64000000U)
#define RCC_VCO_MAX_FREQ_RANGE1 (344000000U)
#define RCC_VCO_MAX_FREQ_RANGE2 (128000000U)
#define RCC_SYSCLK_MAX_FREQ_RANGE1 (80000000U)
#define RCC_SYSCLK_MAX_FREQ_RANGE2 (26000000U)
#define RCC_MAX_TIMEOUT (5000U)


#define RCC_PWR_CLK_ENABLE() do \
{ \
	_MACRO_SET_BIT(RCC->apb1enr1, RCC_PWR_POS); \
	cpu_busy_wait(2); \
}while(0)

#define RCC_USB_CLK_ENABLE() do \
{ \
	_MACRO_SET_BIT(RCC->apb1enr1, RCC_USB_POS); \
	cpu_busy_wait(2); \
}while(0)

#define RCC_GPIOA_CLK_ENABLE() do \
{ \
	_MACRO_SET_BIT(RCC->ahb2enr, RCC_GPIOA_POS); \
	cpu_busy_wait(2); \
}while(0)

#define RCC_GPIOB_CLK_ENABLE() do \
{ \
	_MACRO_SET_BIT(RCC->ahb2enr, RCC_GPIOB_POS); \
	cpu_busy_wait(2); \
}while(0)

#define RCC_USB_DP_CLK_ENABLE() RCC_GPIOA_CLK_ENABLE()
#define RCC_USB_DM_CLK_ENABLE() RCC_GPIOA_CLK_ENABLE()
#define RCC_SWDIO_CLK_ENABLE() RCC_GPIOB_CLK_ENABLE()
#define RCC_SWCLK_CLK_ENABLE() RCC_GPIOB_CLK_ENABLE()
#define RCC_nRESET_CLK_ENABLE() RCC_GPIOB_CLK_ENABLE()

/*******************************************************************************
- FLASH for STM32L412
******************************************************************************/
typedef struct
{
	volatile uint32_t acr;
	volatile uint32_t pdkeyr;
	volatile uint32_t keyr;
	volatile uint32_t optkeyr;
	volatile uint32_t sr;
	volatile uint32_t cr;
	volatile uint32_t eccr;
	volatile uint32_t optr;
	volatile uint32_t pcrop1sr;
	volatile uint32_t pcrop1er;
	volatile uint32_t wrp1ar;
	volatile uint32_t wrp1br;
}flash_reg_type;

#define FLASH_BASE_ADDR (0x40022000UL)

#define FLASH ((flash_reg_type*) FLASH_BASE_ADDR)

#define FLASH_LATENCY_POS (0x0U)
#define FLASH_PRFTEN_POS (0x8U)
#define FLASH_ICEN_POS (0x9U)
#define FLASH_DCEN_POS (0xAU)

#define FLASH_LATENCY_1_WAIT_STATES (0x1U)
#define FLASH_LATENCY_2_WAIT_STATES (0x2U)
#define FLASH_LATENCY_3_WAIT_STATES (0x3U)
#define FLASH_LATENCY_4_WAIT_STATES (0x4U)
#define FLASH_LATENCY_MASK (0x7U)

#define FLASH_SET_LATENCY_1_WAIT_STATES() _MACRO_SET_BIT_VAL(FLASH->acr, FLASH_LATENCY_1_WAIT_STATES, FLASH_LATENCY_POS)
#define FLASH_SET_LATENCY_2_WAIT_STATES() _MACRO_SET_BIT_VAL(FLASH->acr, FLASH_LATENCY_2_WAIT_STATES, FLASH_LATENCY_POS)
#define FLASH_SET_LATENCY_3_WAIT_STATES() _MACRO_SET_BIT_VAL(FLASH->acr, FLASH_LATENCY_3_WAIT_STATES, FLASH_LATENCY_POS)
#define FLASH_SET_LATENCY_4_WAIT_STATES() _MACRO_SET_BIT_VAL(FLASH->acr, FLASH_LATENCY_4_WAIT_STATES, FLASH_LATENCY_POS)
#define FLASH_SET_PREFETCH() _MACRO_SET_BIT(FLASH->acr, FLASH_PRFTEN_POS)

/*******************************************************************************
- USB for STM32L412
******************************************************************************/
typedef struct
{
	volatile uint32_t cntr; /*!< USB control register */
	volatile uint32_t istr; /*!< USB interrupt status register */
	volatile uint32_t fnr; /*!< USB frame number register */
	volatile uint32_t daddr; /*!< USB device address */
	volatile uint32_t btable; /*!< Buffer table address */
	volatile uint32_t lpmcsr; /*!< LPM control and status register */
	volatile uint32_t bcdr; /*!< Battery charging detector */
}usbd_fullspeed_type;

#define USBD_FS_BASE_ADDR (0x40006840UL) /*!< USB Register Base Address */
#define USBD_SRAM_BASE_ADDR (0x40006C00UL) /*!< USB SRAM Register Base Address */
#define USB_EP_BASE_ADDR (0x40006800UL) /*!< Endpoint Base Address */

#define USBD ((usbd_fullspeed_type*) USBD_FS_BASE_ADDR) /*!< Pointer to USB Base Address */
#define USBD_ENDPOINT_N_REG(ep_num) (uint16_t*) (USB_EP_BASE_ADDR + ((ep_num) << 0x2U)) /*!< Pointer to endpoint n register. */
#define USBD_BTABLE_REG(ep_num, offset) (uint16_t*) (USBD_SRAM_BASE_ADDR + (USBD->btable) + ((ep_num) << 0x3U) + (offset))

#define USBD_ENDPOINT_0 (0x0U)
#define USBD_ENDPOINT_1 (0x1U) /*OUT Bulk endpoint*/
#define USBD_ENDPOINT_2 (0x2U) /*IN Bulk endpoint*/

#define USBD_ENDPOINT_0_REG (uint16_t*) (USB_EP_BASE_ADDR) /*!< Pointer to endpoint 0 register. */
#define USBD_ENDPOINT_1_REG (uint16_t*) (USB_EP_BASE_ADDR + 4) /*!< Pointer to endpoint 1 register. */
#define USBD_ENDPOINT_2_REG (uint16_t*) (USB_EP_BASE_ADDR + 8) /*!< Pointer to endpoint 2 register. */

/*bcdr bits*/
#define USBD_BCDR_DP_PULLUP_POS (0xFU)

/*daddr bits*/
#define USBD_DADDR_POS (0x0U)
#define USBD_DADDR_EF_POS (0x7U)

#define USBD_DADDR_MASK (0x7FU)

/*cntr bits*/
#define USBD_CNTR_FRES_POS (0x0U)
#define USBD_CNTR_PDWN_POS (0x1U)
#define USBD_CNTR_LP_MODE_POS (0x2U)
#define USBD_CNTR_FSUSP_POS (0x3U)
#define USBD_CNTR_RESUME_POS (0x4U)
#define USBD_CNTR_L1RESUME_POS (0x5U)
#define USBD_CNTR_L1REQM_POS (0x7U)
#define USBD_CNTR_ESOFM_POS (0x8U)
#define USBD_CNTR_SOFM_POS (0x9U)
#define USBD_CNTR_RESETM_POS (0xAU)
#define USBD_CNTR_SUSPM_POS (0xBU)
#define USBD_CNTR_WKUPM_POS (0xCU)
#define USBD_CNTR_ERRM_POS (0xDU)
#define USBD_CNTR_PMAOVRM_POS (0xEU)
#define USBD_CNTR_CTRM_POS (0xFU)

/*Unused interrupts*/
#define USBD_CNTR_L1REQM (0x1U << USBD_CNTR_L1REQM_POS)
#define USBD_CNTR_ESOFM (0x1U << USBD_CNTR_ESOFM_POS)
#define USBD_CNTR_SOFM (0x1U << USBD_CNTR_SOFM_POS)
#define USBD_CNTR_ERRM (0x1U << USBD_CNTR_ERRM_POS)
#define USBD_CNTR_PMAOVRM (0x1U << USBD_CNTR_PMAOVRM_POS)

#define USBD_CNTR_RESETM (0x1U << USBD_CNTR_RESETM_POS)
#define USBD_CNTR_SUSPM (0x1U << USBD_CNTR_SUSPM_POS)
#define USBD_CNTR_WKUPM (0x1U << USBD_CNTR_WKUPM_POS)
#define USBD_CNTR_CTRM (0x1U << USBD_CNTR_CTRM_POS)

/*istr bits*/
#define USBD_ISTR_EP_ID_POS (0x0U)
#define USBD_ISTR_DIR_POS (0x4U)
#define USBD_ISTR_L1REQ_POS (0x7U)
#define USBD_ISTR_ESOF_POS (0x8U)
#define USBD_ISTR_SOF_POS (0x9U)
#define USBD_ISTR_RESET_POS (0xAU)
#define USBD_ISTR_SUSP_POS (0xBU)
#define USBD_ISTR_WKUP_POS (0xCU)
#define USBD_ISTR_ERR_POS (0xDU)
#define USBD_ISTR_PMAOVR_POS (0xEU)
#define USBD_ISTR_CTR_POS (0xFU)

