JamesBara/DAP_Link_Tiny/Inc/stm32l412_def.h
#define USBD_ISTR_EP_ID_MASK (0xFU)

#define USBD_ISTR_L1REQ (USBD_ISTR_L1REQ_POS)
#define USBD_ISTR_ESOF (USBD_ISTR_ESOF_POS)
#define USBD_ISTR_SOF (USBD_ISTR_SOF_POS)
#define USBD_ISTR_RESET (USBD_ISTR_RESET_POS)
#define USBD_ISTR_SUSP (USBD_ISTR_SUSP_POS)
#define USBD_ISTR_WKUP (USBD_ISTR_WKUP_POS)
#define USBD_ISTR_ERR (USBD_ISTR_ERR_POS)
#define USBD_ISTR_PMAOVR (USBD_ISTR_PMAOVR_POS)
#define USBD_ISTR_CTR (USBD_ISTR_CTR_POS)

/*fnr bits*/
#define USBD_FNR_FN_POS (0x0U)
#define USBD_FNR_RXDM_POS (0xEU)
#define USBD_FNR_RXDP_POS (0xFU)
#define USBD_FNR_FN_MASK (0x7FFU)

/*Misc.*/
#define USBD_DIR_OUT (0x0U)
#define USBD_DIR_IN (0x1U)

/*USB SRAM definitions*/
#define USBD_SRAM_NUMBLOCK_POS (0xAU)

#define USBD_SRAM_BLSIZE_MASK (0x8000U)
#define USBD_SRAM_NUMBLOCK_MASK (0x7C00U)
#define USBD_SRAM_RX_COUNT_ALLOC(x) (uint16_t) (((uint16_t)(x) > 0x3EU) \
    ? (uint16_t)(USBD_SRAM_BLSIZE_MASK | ((((uint16_t)(x) >> 0x5U) - 0x1U) << USBD_SRAM_NUMBLOCK_POS)) \
	: (uint16_t)(((uint16_t)(x) >> 0x1U) << USBD_SRAM_NUMBLOCK_POS))
#define USBD_SRAM_COUNT_MASK (0x3FFU)

#define USBD_SRAM_SIZE (0x400U)

/*Hardware endpoint definitions*/
/*endpoint bits*/
#define USBD_EP_ADDRESS_POS (0x0U)
#define USBD_EP_STAT_TX_POS (0x4U)
#define USBD_EP_DTOG_TX_POS (0x6U)
#define USBD_EP_SWBUF_RX_POS USBD_EP_DTOG_TX_POS
#define USBD_EP_CTR_TX_POS (0x7U)
#define USBD_EP_KIND_POS (0x8U)
#define USBD_EP_TYPE_POS (0x9U)
#define USBD_EP_SETUP_POS (0xBU)
#define USBD_EP_STAT_RX_POS (0xCU)
#define USBD_EP_DTOG_RX_POS (0xEU)
#define USBD_EP_SWBUF_TX_POS USBD_EP_DTOG_RX_POS
#define USBD_EP_CTR_RX_POS (0xFU)

#define USBD_EP_ADDRESS_MASK (0xFU)
#define USBD_EP_STAT_MASK (0x3U)
#define USBD_EP_TYPE_MASK (0x3U)

#define USBD_EP_STAT_DISABLED (0x0U)
#define USBD_EP_STAT_STALL (0x1U)
#define USBD_EP_STAT_NAK (0x2U)
#define USBD_EP_STAT_VALID (0x3U)

#define USBD_EP_KIND_DBL_BUF (0x1U)

#define USBD_HW_EP_TYPE_BULK (0x0U)
#define USBD_HW_EP_TYPE_CONTROL (0x1U)
#define USBD_HW_EP_TYPE_ISOCHRONOUS (0x2U)
#define USBD_HW_EP_TYPE_INTERRUPT (0x3U)

/*Masks for the rw bits.*/
#define USBD_EP_DBL_BUF_MASK (USBD_EP_KIND_DBL_BUF << USBD_EP_KIND_POS)
#define USBD_EP_STATUS_OUT_MASK USBD_EP_DBL_BUF_MASK

#define USBD_EP_TYPE_BIT_MASK (USBD_EP_TYPE_MASK << USBD_EP_TYPE_POS)
#define USBD_EP_TYPE_BULK_MASK (USBD_HW_EP_TYPE_BULK << USBD_EP_TYPE_POS)
#define USBD_EP_TYPE_CONTROL_MASK (USBD_HW_EP_TYPE_CONTROL << USBD_EP_TYPE_POS)
#define USBD_EP_TYPE_ISOCHRONOUS_MASK (USBD_HW_EP_TYPE_ISOCHRONOUS << USBD_EP_TYPE_POS)
#define USBD_EP_TYPE_INTERRUPT_MASK (USBD_HW_EP_TYPE_INTERRUPT << USBD_EP_TYPE_POS)

/*Masks for the toggle bits.*/
#define USBD_EP_STAT_TX_MASK (USBD_EP_STAT_MASK << USBD_EP_STAT_TX_POS)
#define USBD_EP_DTOG_TX_MASK (0x1U << USBD_EP_DTOG_TX_POS)
#define USBD_EP_SWBUF_RX_MASK USBD_EP_DTOG_TX_MASK
#define USBD_EP_CTR_TX_MASK (0x1U << USBD_EP_CTR_TX_POS)
#define USBD_EP_STAT_RX_MASK (USBD_EP_STAT_MASK << USBD_EP_STAT_RX_POS)
#define USBD_EP_DTOG_RX_MASK (0x1U << USBD_EP_DTOG_RX_POS)
#define USBD_EP_SWBUF_TX_MASK USBD_EP_DTOG_RX_MASK
#define USBD_EP_CTR_RX_MASK (0x1U << USBD_EP_CTR_RX_POS)

/*Flags for the stat bits*/
#define USBD_EP_STAT_RX_DISABLED (USBD_EP_STAT_DISABLED << USBD_EP_STAT_RX_POS)
#define USBD_EP_STAT_TX_DISABLED (USBD_EP_STAT_DISABLED << USBD_EP_STAT_TX_POS)
#define USBD_EP_STAT_RX_STALL (USBD_EP_STAT_STALL << USBD_EP_STAT_RX_POS)
#define USBD_EP_STAT_TX_STALL (USBD_EP_STAT_STALL << USBD_EP_STAT_TX_POS)
#define USBD_EP_STAT_RX_NAK (USBD_EP_STAT_NAK << USBD_EP_STAT_RX_POS)
#define USBD_EP_STAT_TX_NAK (USBD_EP_STAT_NAK << USBD_EP_STAT_TX_POS)
#define USBD_EP_STAT_RX_VALID (USBD_EP_STAT_VALID << USBD_EP_STAT_RX_POS)
#define USBD_EP_STAT_TX_VALID (USBD_EP_STAT_VALID << USBD_EP_STAT_TX_POS)

/*Masks for the whole register per bit type.*/
#define USBD_EP_RW_MASK ((0x1U << USBD_EP_SETUP_POS) | (USBD_EP_TYPE_MASK << USBD_EP_TYPE_POS) | (0x1U << USBD_EP_KIND_POS) | (USBD_EP_ADDRESS_MASK << USBD_EP_ADDRESS_POS))
#define USBD_EP_RC_W0_MASK (USBD_EP_CTR_RX_MASK | USBD_EP_CTR_TX_MASK)
#define USBD_EP_T_MASK (USBD_EP_DTOG_RX_MASK | USBD_EP_STAT_RX_MASK | USBD_EP_DTOG_TX_MASK | USBD_EP_STAT_TX_MASK)

/*Configuration of an endpoint. To set a toggle bit set the t_flags and the 
*t_masks, to clear a toggle bit set the t_masks only, to preserve the current
*value don't mask the bits. Type must be of value USBD_HW_EP_TYPE_BULK, 
*USBD_HW_EP_TYPE_CONTROL, USBD_HW_EP_TYPE_ISOCHRONOUS or USBD_HW_EP_TYPE_INTERRUPT
*kind must be of value USBD_EP_KIND_DBL_BUF or 0 address must be of value 0-7*/
#define USBD_EP_CONFIGURATION(reg, type, kind, address, t_flags, t_masks) ((((reg) ^ (t_flags)) & (t_masks)) | USBD_EP_RC_W0_MASK | ((type) << USBD_EP_TYPE_POS) | ((kind) << USBD_EP_KIND_POS) | ((address) << USBD_EP_ADDRESS_POS))

/*Set or clear the rw bits while preserving all other bits.*/
#define USBD_EP_SET_RW(reg, rw_masks) ((((reg) & ~USBD_EP_T_MASK) | USBD_EP_RC_W0_MASK) | (rw_masks))
#define USBD_EP_CLEAR_RW(reg, rw_masks) ((((reg) & ~USBD_EP_T_MASK) | USBD_EP_RC_W0_MASK) & ~(rw_masks))

/*Clear rc_w0 bits while preserving all other bits.*/
#define USBD_EP_CLEAR_RC_W0(reg, rc_w0_masks) ((((reg) & ~USBD_EP_T_MASK) | USBD_EP_RC_W0_MASK) & ~(rc_w0_masks))

/*Modify the toggle bits while preserving all other bits. To set a toggle bit set the t_flags and the t_masks, to clear a toggle bit set the t_masks only, to preserve the current value don't mask the bits.*/
#define USBD_EP_SET_TOGGLE(reg, t_flags, t_masks) ((((reg) ^ (t_flags)) & (USBD_EP_RW_MASK | (t_masks))) | USBD_EP_RC_W0_MASK)



/*Hardcoding everything that has to do with endpoints.*/

/*The first 24 bytes in the packet memory area are used by the buffer table.*/
#define USBD_ENDPOINT_0_IN_ADDR_OFFSET (0x18U) /*!< The next 64 bytes by endpoint 0 in direction.*/
#define USBD_ENDPOINT_0_OUT_ADDR_OFFSET (0x58U) /*!< The next 64 bytes by endpoint 0 out direction.*/
#define USBD_ENDPOINT_1_OUT_ADDR_OFFSET (0x98U) /*!< The next 64 bytes are used by endpoint 1 out direction and 64 are reserved for double buffer.*/
#define USBD_ENDPOINT_2_IN_ADDR_OFFSET (0x118U) /*!< The next 64 bytes are used by endpoint 2 in direction and 64 are reserved for double buffer.*/

#define USBD_FS_MAXPACKETSIZE (0x40U)

#define USBD_ENDPOINT_0_TX_PMA_BUF (uint16_t*)(USBD_SRAM_BASE_ADDR + USBD_ENDPOINT_0_IN_ADDR_OFFSET) /*!< Pointer to endpoint 0 in PMA buffer.*/
#define USBD_ENDPOINT_0_RX_PMA_BUF (uint16_t*)(USBD_SRAM_BASE_ADDR + USBD_ENDPOINT_0_OUT_ADDR_OFFSET) /*!< Pointer to endpoint 0 out PMA buffer.*/

#define USBD_ENDPOINT_1_RX_0_PMA_BUF (uint16_t*)(USBD_SRAM_BASE_ADDR + USBD_ENDPOINT_1_OUT_ADDR_OFFSET) /*!< Pointer to endpoint 1 in 0 PMA buffer.*/
#define USBD_ENDPOINT_1_RX_1_PMA_BUF (uint16_t*)(USBD_SRAM_BASE_ADDR + USBD_ENDPOINT_1_OUT_ADDR_OFFSET + USBD_FS_MAXPACKETSIZE) /*!< Pointer to endpoint 1 in 1 PMA buffer.*/
#define USBD_ENDPOINT_1_RX_PMA_BUF USBD_ENDPOINT_1_RX_1_PMA_BUF


