JamesBara/DAP_Link_Tiny/Inc/stm32l412_def.h
#define USBD_ENDPOINT_2_TX_0_PMA_BUF (uint16_t*)(USBD_SRAM_BASE_ADDR + USBD_ENDPOINT_2_IN_ADDR_OFFSET) /*!< Pointer to endpoint 2 out 0 PMA buffer.*/
#define USBD_ENDPOINT_2_TX_1_PMA_BUF (uint16_t*)(USBD_SRAM_BASE_ADDR + USBD_ENDPOINT_2_IN_ADDR_OFFSET + USBD_FS_MAXPACKETSIZE) /*!< Pointer to endpoint 2 out 1 PMA buffer.*/
#define USBD_ENDPOINT_2_TX_PMA_BUF USBD_ENDPOINT_2_TX_0_PMA_BUF /*!< Pointer to endpoint 2 out 0 PMA buffer.*/

/*Hardcoded pma for endpoint 0*/
#define USBD_ENDPOINT_0_CLEAR_TX_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable)) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_0_CLEAR_TX_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 2) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_0_CLEAR_RX_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 4) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_0_CLEAR_RX_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 6) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_0_SET_TX_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable)) = (uint16_t)USBD_ENDPOINT_0_IN_ADDR_OFFSET; \
}while(0)

#define USBD_ENDPOINT_0_SET_TX_COUNT(count) do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 2) = (uint16_t)(count); \
}while(0)

#define USBD_ENDPOINT_0_SET_RX_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 4) = (uint16_t)USBD_ENDPOINT_0_OUT_ADDR_OFFSET; \
}while(0)

#define USBD_ENDPOINT_0_SET_RX_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 6) = USBD_SRAM_RX_COUNT_ALLOC(USBD_FS_MAXPACKETSIZE); \
}while(0)

#define USBD_ENDPOINT_0_GET_RX_COUNT() (uint16_t)((*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 6)) & USBD_SRAM_COUNT_MASK)

/*Hardcoded pma for endpoint 1*/

#define USBD_ENDPOINT_1_CLEAR_RX_0_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 8) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_1_CLEAR_RX_0_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 10) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_1_CLEAR_RX_1_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 12) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_1_CLEAR_RX_1_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 14) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_1_SET_RX_0_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 8) = (uint16_t)USBD_ENDPOINT_1_OUT_ADDR_OFFSET; \
}while(0)

#define USBD_ENDPOINT_1_SET_RX_0_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 10) = USBD_SRAM_RX_COUNT_ALLOC(USBD_FS_MAXPACKETSIZE); \
}while(0)

#define USBD_ENDPOINT_1_SET_RX_1_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 12) = (uint16_t)(USBD_ENDPOINT_1_OUT_ADDR_OFFSET + USBD_FS_MAXPACKETSIZE); \
}while(0)

#define USBD_ENDPOINT_1_SET_RX_1_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 14) = USBD_SRAM_RX_COUNT_ALLOC(USBD_FS_MAXPACKETSIZE); \
}while(0)

#define USBD_ENDPOINT_1_GET_RX_0_COUNT() (uint16_t)((*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 10)) & USBD_SRAM_COUNT_MASK)

#define USBD_ENDPOINT_1_GET_RX_1_COUNT() (uint16_t)((*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 14)) & USBD_SRAM_COUNT_MASK)

#define USBD_ENDPOINT_1_GET_RX_COUNT() USBD_ENDPOINT_1_GET_RX_1_COUNT()




/*Hardcoded pma for endpoint 2*/
#define USBD_ENDPOINT_2_CLEAR_TX_0_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 16) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_2_CLEAR_TX_0_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 18) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_2_CLEAR_TX_1_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 20) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_2_CLEAR_TX_1_COUNT() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 22) = 0x0U; \
}while(0)

#define USBD_ENDPOINT_2_SET_TX_0_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 16) = (uint16_t)USBD_ENDPOINT_2_IN_ADDR_OFFSET; \
}while(0)

#define USBD_ENDPOINT_2_SET_TX_0_COUNT(count) do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 18) = (uint16_t)(count); \
}while(0)

#define USBD_ENDPOINT_2_SET_TX_1_ADDR() do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 20) = (uint16_t)(USBD_ENDPOINT_2_IN_ADDR_OFFSET + USBD_FS_MAXPACKETSIZE); \
}while(0)

#define USBD_ENDPOINT_2_SET_TX_1_COUNT(count) do \
{ \
	*(uint16_t*)(USBD_SRAM_BASE_ADDR + (USBD->btable) + 22) = (uint16_t)(count); \
}while(0)

#define USBD_ENDPOINT_2_SET_TX_COUNT(count) USBD_ENDPOINT_2_SET_TX_0_COUNT(count)





























/*Hardcoded configurations of endpoints.*/
#define USBD_CLEAR_ENDPOINT_0_CONFIGURATION() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_0_REG; \
	USBD_ENDPOINT_0_CLEAR_TX_ADDR(); \
	USBD_ENDPOINT_0_CLEAR_TX_COUNT(); \
	USBD_ENDPOINT_0_CLEAR_RX_ADDR(); \
	USBD_ENDPOINT_0_CLEAR_RX_COUNT(); \
	ep_val = USBD_EP_CONFIGURATION(ep_val, 0x0U, 0x0U, USBD_ENDPOINT_0, 0x0U, (USBD_EP_DTOG_RX_MASK | USBD_EP_STAT_RX_MASK | USBD_EP_DTOG_TX_MASK | USBD_EP_STAT_TX_MASK)); \
	(!_MACRO_GET_BIT(ep_val, USBD_EP_CTR_RX_POS)) ? (_MACRO_SET_BIT(ep_val, USBD_EP_CTR_RX_POS)) : (_MACRO_CLEAR_BIT(ep_val, USBD_EP_CTR_RX_POS)); \
	(!_MACRO_GET_BIT(ep_val, USBD_EP_CTR_TX_POS)) ? (_MACRO_SET_BIT(ep_val, USBD_EP_CTR_TX_POS)) : (_MACRO_CLEAR_BIT(ep_val, USBD_EP_CTR_TX_POS)); \
	 *USBD_ENDPOINT_0_REG = ep_val; \
}while(0)

#define USBD_CLEAR_ENDPOINT_1_CONFIGURATION() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_1_REG; \
	USBD_ENDPOINT_1_CLEAR_RX_0_ADDR(); \
	USBD_ENDPOINT_1_CLEAR_RX_0_COUNT(); \
	USBD_ENDPOINT_1_CLEAR_RX_1_ADDR(); \
	USBD_ENDPOINT_1_CLEAR_RX_1_COUNT(); \
	ep_val = USBD_EP_CONFIGURATION(ep_val, 0x0U, 0x0U, USBD_ENDPOINT_1, 0x0U, (USBD_EP_DTOG_RX_MASK | USBD_EP_STAT_RX_MASK | USBD_EP_DTOG_TX_MASK | USBD_EP_STAT_TX_MASK)); \
	(!_MACRO_GET_BIT(ep_val, USBD_EP_CTR_RX_POS)) ? (_MACRO_SET_BIT(ep_val, USBD_EP_CTR_RX_POS)) : (_MACRO_CLEAR_BIT(ep_val, USBD_EP_CTR_RX_POS)); \
	(!_MACRO_GET_BIT(ep_val, USBD_EP_CTR_TX_POS)) ? (_MACRO_SET_BIT(ep_val, USBD_EP_CTR_TX_POS)) : (_MACRO_CLEAR_BIT(ep_val, USBD_EP_CTR_TX_POS)); \
	 *USBD_ENDPOINT_1_REG = ep_val; \
}while(0)

#define USBD_CLEAR_ENDPOINT_2_CONFIGURATION() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_2_REG; \
	USBD_ENDPOINT_2_CLEAR_TX_0_ADDR(); \
	USBD_ENDPOINT_2_CLEAR_TX_0_COUNT(); \
	USBD_ENDPOINT_2_CLEAR_TX_1_ADDR(); \
	USBD_ENDPOINT_2_CLEAR_TX_1_COUNT(); \
	ep_val = USBD_EP_CONFIGURATION(ep_val, 0x0U, 0x0U, USBD_ENDPOINT_2, 0x0U, (USBD_EP_DTOG_RX_MASK | USBD_EP_STAT_RX_MASK | USBD_EP_DTOG_TX_MASK | USBD_EP_STAT_TX_MASK)); \
	(!_MACRO_GET_BIT(ep_val, USBD_EP_CTR_RX_POS)) ? (_MACRO_SET_BIT(ep_val, USBD_EP_CTR_RX_POS)) : (_MACRO_CLEAR_BIT(ep_val, USBD_EP_CTR_RX_POS)); \
	(!_MACRO_GET_BIT(ep_val, USBD_EP_CTR_TX_POS)) ? (_MACRO_SET_BIT(ep_val, USBD_EP_CTR_TX_POS)) : (_MACRO_CLEAR_BIT(ep_val, USBD_EP_CTR_TX_POS)); \
	 *USBD_ENDPOINT_2_REG = ep_val; \
}while(0)

#define USBD_SET_ENDPOINT_0_CONFIGURATION() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_0_REG; \
	USBD_ENDPOINT_0_SET_TX_ADDR(); \
	USBD_ENDPOINT_0_SET_RX_ADDR(); \
	USBD_ENDPOINT_0_SET_RX_COUNT(); \
	*USBD_ENDPOINT_0_REG = USBD_EP_CONFIGURATION(ep_val, USBD_HW_EP_TYPE_CONTROL, 0x0U, USBD_ENDPOINT_0, (USBD_EP_STAT_RX_VALID | USBD_EP_STAT_TX_NAK), (USBD_EP_DTOG_RX_MASK | USBD_EP_STAT_RX_MASK | USBD_EP_DTOG_TX_MASK | USBD_EP_STAT_TX_MASK)); \
}while(0)

#define USBD_SET_ENDPOINT_1_CONFIGURATION() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_1_REG; \
	USBD_ENDPOINT_1_SET_RX_0_ADDR(); \
	USBD_ENDPOINT_1_SET_RX_0_COUNT(); \
	USBD_ENDPOINT_1_SET_RX_1_ADDR(); \
	USBD_ENDPOINT_1_SET_RX_1_COUNT(); \
	*USBD_ENDPOINT_1_REG = USBD_EP_CONFIGURATION(ep_val, USBD_HW_EP_TYPE_BULK, 0x0U, USBD_ENDPOINT_1, USBD_EP_STAT_RX_VALID, (USBD_EP_DTOG_RX_MASK | USBD_EP_STAT_RX_MASK | USBD_EP_DTOG_TX_MASK | USBD_EP_STAT_TX_MASK)); \
}while(0)

#define USBD_SET_ENDPOINT_2_CONFIGURATION() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_2_REG; \
	USBD_ENDPOINT_2_SET_TX_0_ADDR(); \
	USBD_ENDPOINT_2_SET_TX_1_ADDR(); \
	*USBD_ENDPOINT_2_REG = USBD_EP_CONFIGURATION(ep_val, USBD_HW_EP_TYPE_BULK, 0x0U, USBD_ENDPOINT_2, USBD_EP_STAT_TX_NAK, (USBD_EP_DTOG_RX_MASK | USBD_EP_STAT_RX_MASK | USBD_EP_DTOG_TX_MASK | USBD_EP_STAT_TX_MASK)); \
}while(0)

/*Hardcoded endpoint 0 commands.*/

