JamesBara/DAP_Link_Tiny/Inc/stm32l412_def.h
#define USBD_ENDPOINT_0_SET_STALL() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_0_REG; \
	*USBD_ENDPOINT_0_REG = USBD_EP_SET_TOGGLE(ep_val, (USBD_EP_STAT_RX_STALL | USBD_EP_STAT_TX_STALL), (USBD_EP_STAT_RX_MASK | USBD_EP_STAT_TX_MASK)); \
}while(0)

#define USBD_ENDPOINT_0_SET_TX_VALID() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_0_REG; \
	*USBD_ENDPOINT_0_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_TX_VALID, USBD_EP_STAT_TX_MASK); \
}while(0)

#define USBD_ENDPOINT_0_SET_RX_VALID() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_0_REG; \
	*USBD_ENDPOINT_0_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_RX_VALID, USBD_EP_STAT_RX_MASK); \
}while(0)

#define USBD_ENDPOINT_0_TRANSMIT_ZLP() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_0_REG; \
	USBD_ENDPOINT_0_SET_TX_COUNT(0); \
	*USBD_ENDPOINT_0_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_TX_VALID, USBD_EP_STAT_TX_MASK); \
}while(0)

#define USBD_ENDPOINT_0_SET_KIND() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_0_REG; \
	*USBD_ENDPOINT_0_REG = USBD_EP_SET_RW(ep_val, USBD_EP_STATUS_OUT_MASK); \
}while(0)

#define USBD_ENDPOINT_0_CLEAR_KIND() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_0_REG; \
	*USBD_ENDPOINT_0_REG = USBD_EP_CLEAR_RW(ep_val, USBD_EP_STATUS_OUT_MASK); \
}while(0)



/*Hardcoded endpoint 1 commands.*/

#define USBD_ENDPOINT_1_GET_STALL() ((*USBD_ENDPOINT_1_REG & USBD_EP_STAT_RX_MASK) == USBD_EP_STAT_RX_STALL) ? 0x1U : 0x0U

#define USBD_ENDPOINT_1_SET_STALL() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_1_REG; \
	if ((ep_val & USBD_EP_STAT_RX_MASK) != USBD_EP_STAT_RX_DISABLED) \
	*USBD_ENDPOINT_1_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_RX_VALID, USBD_EP_STAT_RX_MASK); \
}while(0)

#define USBD_ENDPOINT_1_CLEAR_STALL() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_1_REG; \
	if ((ep_val & USBD_EP_STAT_RX_MASK) == USBD_EP_STAT_RX_STALL) \
	*USBD_ENDPOINT_1_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_RX_VALID, (USBD_EP_STAT_RX_MASK | USBD_EP_DTOG_RX_MASK | USBD_EP_SWBUF_RX_MASK)); \
}while(0)

#define USBD_ENDPOINT_1_GET_DOUBLE_BUFFER() _MACRO_GET_BIT((*USBD_ENDPOINT_1_REG), USBD_EP_KIND_POS)

#define USBD_ENDPOINT_1_SET_DOUBLE_BUFFER() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_1_REG; \
	*USBD_ENDPOINT_1_REG = USBD_EP_SET_RW(ep_val, USBD_EP_DBL_BUF_MASK); \
	ep_val = *USBD_ENDPOINT_1_REG; \
	*USBD_ENDPOINT_1_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_RX_VALID, USBD_EP_STAT_RX_MASK); \
}while(0)

#define USBD_ENDPOINT_1_CLEAR_DOUBLE_BUFFER() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_1_REG; \
	*USBD_ENDPOINT_1_REG = USBD_EP_CLEAR_RW(ep_val, USBD_EP_DBL_BUF_MASK); \
	ep_val = *USBD_ENDPOINT_1_REG; \
	*USBD_ENDPOINT_1_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_RX_VALID, (USBD_EP_STAT_RX_MASK | USBD_EP_SWBUF_TX_MASK)); \
}while(0)

#define USBD_ENDPOINT_1_SET_VALID() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_1_REG; \
	*USBD_ENDPOINT_1_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_RX_VALID, USBD_EP_STAT_RX_MASK); \
}while(0)

#define USBD_ENDPOINT_1_GET_DTOG_RX() _MACRO_GET_BIT((*USBD_ENDPOINT_1_REG), USBD_EP_DTOG_RX_POS)

#define USBD_ENDPOINT_1_GET_SWBUF_RX() _MACRO_GET_BIT((*USBD_ENDPOINT_1_REG), USBD_EP_SWBUF_RX_POS)

#define USBD_ENDPOINT_1_TOGGLE_SWBUF_RX() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_1_REG; \
	*USBD_ENDPOINT_1_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_SWBUF_RX_POS, USBD_EP_SWBUF_RX_MASK); \
}while(0)

/*Hardcoded endpoint 2 commands.*/
#define USBD_ENDPOINT_2_GET_STALL() ((*USBD_ENDPOINT_2_REG & USBD_EP_STAT_TX_MASK) == USBD_EP_STAT_TX_STALL) ? 0x1U : 0x0U

#define USBD_ENDPOINT_2_SET_STALL() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_2_REG; \
	if ((ep_val & USBD_EP_STAT_TX_MASK) != USBD_EP_STAT_TX_DISABLED) \
	*USBD_ENDPOINT_2_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_TX_STALL, USBD_EP_STAT_TX_MASK); \
}while(0)

#define USBD_ENDPOINT_2_CLEAR_STALL() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_2_REG; \
	if ((ep_val & USBD_EP_STAT_TX_MASK) == USBD_EP_STAT_TX_STALL) \
	*USBD_ENDPOINT_2_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_TX_NAK, (USBD_EP_STAT_TX_MASK | USBD_EP_DTOG_TX_MASK | USBD_EP_SWBUF_TX_MASK)); \
}while(0)

#define USBD_ENDPOINT_2_GET_DOUBLE_BUFFER() _MACRO_GET_BIT((*USBD_ENDPOINT_N_REG(USBD_ENDPOINT_2)), USBD_EP_KIND_POS)

#define USBD_ENDPOINT_2_SET_DOUBLE_BUFFER() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_2_REG; \
	*USBD_ENDPOINT_2_REG = USBD_EP_SET_RW(ep_val, USBD_EP_DBL_BUF_MASK); \
	ep_val = *USBD_ENDPOINT_2_REG; \
	*USBD_ENDPOINT_2_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_TX_DISABLED, USBD_EP_STAT_TX_MASK); \
}while(0)

#define USBD_ENDPOINT_2_CLEAR_DOUBLE_BUFFER() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_2_REG; \
	*USBD_ENDPOINT_2_REG = USBD_EP_CLEAR_RW(ep_val, USBD_EP_DBL_BUF_MASK); \
}while(0)

#define USBD_ENDPOINT_2_SET_VALID() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_2_REG; \
	*USBD_ENDPOINT_2_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_STAT_TX_VALID, USBD_EP_STAT_TX_MASK); \
}while(0)

#define USBD_ENDPOINT_2_GET_DTOG_TX() _MACRO_GET_BIT((*USBD_ENDPOINT_2_REG), USBD_EP_DTOG_TX_POS)

#define USBD_ENDPOINT_2_GET_SWBUF_TX() _MACRO_GET_BIT((*USBD_ENDPOINT_2_REG), USBD_EP_SWBUF_TX_POS)

#define USBD_ENDPOINT_2_TOGGLE_SWBUF_TX() do \
{ \
	uint16_t ep_val = *USBD_ENDPOINT_2_REG; \
	*USBD_ENDPOINT_2_REG = USBD_EP_SET_TOGGLE(ep_val, USBD_EP_SWBUF_TX_POS, USBD_EP_SWBUF_TX_MASK); \
}while(0)




















#ifdef __cplusplus
}
#endif
#endif /*endif STM32L412_DEF_H*/